База_Back/src/InformationRegisters/СообщенияКОтправке/СообщенияКОтправке.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СообщенияКОтправке</name>
  <resources>
    <name>ТекстСообщения</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостояниеОтправикВRMQ</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаПодключения</name>
    <type>
      <types>CatalogRef.НастройкиПодключенияRMQ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КлючМаршрутизации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>НастройкаОтправки</name>
    <type>
      <types>CatalogRef.НастройкиОтправки</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

База_Back/src/Enums/СостояниеОтправикВRMQ/СостояниеОтправикВRMQ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостояниеОтправикВRMQ</name>
  <enumValues>
    <name>Отправлено</name>
  </enumValues>
  <enumValues>
    <name>НеОтправлено</name>
  </enumValues>
  <enumValues>
    <name>ОшибкаОтправки</name>
  </enumValues>
</mdclass:Enum>

База_Back/src/InformationRegisters/СообщенияКОтправке/ManagerModule.bsl
Процедура ДобавитьЗапись(Параметры) Экспорт
	
	МЗ = СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(МЗ, Параметры);
	МЗ.Состояние = Перечисления.СостояниеОтправикВRMQ.НеОтправлено;
	
	Если Не Параметры.Свойство("ДанныеРегистра") Тогда
		ТекстСообщения = РаботаСRMQ.СформироватьJSONОбъекта(Параметры.Объект); 
	Иначе
		ТекстСообщения = РаботаСRMQ.СформироватьJSONРегистра(Параметры);
	КонецЕсли;	
	
	МЗ.ТекстСообщения = Новый ХранилищеЗначения(ТекстСообщения, Новый СжатиеДанных(9));
	
	МЗ.Записать();
	
	
КонецПроцедуры	

Процедура ОтметитьОтправку(Данные, Состояние) Экспорт
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Объект.Установить(Данные.Объект);
	НаборЗаписей.Отбор.НастройкаПодключения.Установить(Данные.НастройкаПодключения);
	НаборЗаписей.Отбор.КлючМаршрутизации.Установить(Данные.КлючМаршрутизации); 
	НаборЗаписей.Прочитать();
	
	Если НаборЗаписей.Количество() > 0 Тогда 
		
		НаборЗаписей[0].Состояние = Состояние;
		
	КонецЕсли;
	
	НаборЗаписей.Записать();

	
КонецПроцедуры
